*&---------------------------------------------------------------------*
*& Include          SAPMZSA0705_F01
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*& Form get_emp_name
*&---------------------------------------------------------------------*
*& text
*&---------------------------------------------------------------------*
*&      --> ZSSA0073_PERNR
*&      <-- ZSSA0073_ENAME
*&---------------------------------------------------------------------*
FORM get_emp_name  USING    VALUE(p_pernr)
                   CHANGING VALUE(p_ename).


  CALL FUNCTION 'ZFSA07_01'
    EXPORTING
      iv_pernr = p_pernr
    IMPORTING
      ev_ename = p_ename.

ENDFORM.


"enter 쳐서 가져오는 것과 네모칸 셀렉해서 가져오는 것(위에 쓴 sub-routine_
"서브루틴은 로컬개념 "function module은 글로벌 개념.
*&---------------------------------------------------------------------*
*& Form set_default
*&---------------------------------------------------------------------*
*& text
*&---------------------------------------------------------------------*
*& -->  p1        text
*& <--  p2        text
*&---------------------------------------------------------------------*
FORM set_default CHANGING ps_default TYPE zssa0073.
  CLEAR ps_default.

  SELECT pernr ename
  FROM ztsa0001 UP TO 1 ROWS
  INTO CORRESPONDING FIELDS OF zssa0073.

  ENDSELECT.
ENDFORM.
*&---------------------------------------------------------------------*
*& Form get_emp_info
*&---------------------------------------------------------------------*
*& text
*&---------------------------------------------------------------------*
*&      --> ZSSA0073_PERNR
*&      <-- ZSSA0070
*&---------------------------------------------------------------------*
FORM get_emp_info  USING    VALUE(p_pernr)
                   CHANGING ps_info TYPE zssa0070.


SELECT SINGLE *
  FROM ztsa0001
  INTO CORRESPONDING FIELDS OF ps_info
  WHERE pernr = p_pernr.

ENDFORM.
