*&---------------------------------------------------------------------*
*& Module Pool      YCL107_002
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
PROGRAM YCL107_002.


" 가장 먼저 INCLUDE 정의

INCLUDE YCL107_002_TOP.     " 전역변수
INCLUDE YCL107_002_CLS.     " ALV 관련
INCLUDE YCL107_002_PBO.     " 화면 출력전 PBO
INCLUDE YCL107_002_PAI.     " 화면 출력후 PAI
INCLUDE YCL107_002_F01.     " Subroutines

" 스크린 만드는 것부터 시작 / 화면그리기 로직  / 화면 출력 후 어떻게 구동시킬 것?
" init / start of sel out / 등등 없음
