*&---------------------------------------------------------------------*
*& Report ZRSA07_10
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT zrsa07_10.



DATA: gv_a  TYPE i,
      gv_b  LIKE gv_a,
      gv_r  LIKE gv_b.



gv_a = 10.
gv_b = 100.

* sub-routine의 핵심 !!
 PERFORM cal USING gv_a gv_b gv_r.            "보내고(using)/받는(parameter)변수가 있음.
 "cal 더블클릭해서 form-endform문 만든다. -> form문(공간) 안에꺼 실행 / 연산 -> form공간 사라지고(local 변수가 사라진다는 것과 같은말)
 " -> 사라지고 위로 올라감.   /// 위에 선언된 global 변수는 사라지지 않음. global 변수는 form문 안에서 활용 가능.


gv_r = gv_a + gv_b.

WRITE gv_r.
*&---------------------------------------------------------------------*
*& Form cal
*&---------------------------------------------------------------------*
*& text
*&---------------------------------------------------------------------*
*& -->  p1        text
*& <--  p2        text
*&---------------------------------------------------------------------*
FORM cal USING VALUE(p_a)
               VALUE(p_b)
               CHANGING VALUE(p_r).             "call by value 값만 가져다 쓰고, 원본밸류는 수정하지 않아./// call by value and return.
*gv_r = gv_a + gv_b.
"gv_r = p_a + gv_b.
"gv_r = p_a + p_b.


p_r = p_a + p_b.

ENDFORM.
