*&---------------------------------------------------------------------*
*& Report ZRSA07_11
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT ZRSA07_11.


 DATA: gv_a TYPE sy-datum,            "무엇을 using으로 쓰고, 어떤걸 changing으로 써야하는지 생각.
       gv_b LIKE gv_a,
       gv_C LIKE gv_a,
       gv_d LIKE gv_a.

"gv_a = sy-datum + 7.          "sub-routine으로 감싸는 습관!
" Cal date
PERFORM cal_date USING sy-datum '7'   "value 값을 직접 던질 수 있다.
                 CHANGING gv_a.

"gv_b = sy-datum + 14.         "일단 배우는 입장에서 하나씩 헤보자.
PERFORM cal_date2w USING sy-datum '14'
                   CHANGING gv_b.

"gv_c = sy-datum + 21.
PERFORM cal_date3w USING sy-datum '21'
                   CHANGING gv_c.


gv_d = sy-datum + 28.


PERFORM display_info.                                       "WRITE : gv_a, gv_b, gv_c, gv_d.         "sub-rountine을 호출횄으면 지운다 !
*&---------------------------------------------------------------------*
*& Form display_info
*&---------------------------------------------------------------------*
*& text
*&---------------------------------------------------------------------*
*& -->  p1        text
*& <--  p2        text
*&---------------------------------------------------------------------*


*&---------------------------------------------------------------------*
*& Form cal_date
*&---------------------------------------------------------------------*
*& text
*&---------------------------------------------------------------------*
*& -->  p1        text
*& <--  p2        text
*&---------------------------------------------------------------------*
FORM cal_date USING VALUE(p_date)
                    VALUE(p_days)
              CHANGING VALUE(p_new_date).
"gv_a = sy-datum + 7.
"gv_a = p_date + 7.
p_new_date = p_date + p_days.

ENDFORM.

FORM display_info .
WRITE: gv_a, gv_b, gv_c, gv_d.            "글로벌 변수이므로 sub-routine과 상단에서도 쓸 수 있다.

ENDFORM.

*&---------------------------------------------------------------------*
*& Form cal_date2w
*&---------------------------------------------------------------------*
*& text
*&---------------------------------------------------------------------*
*& -->  p1        text
*& <--  p2        text
*&---------------------------------------------------------------------*
FORM cal_date2w USING VALUE(p_date)
                      VALUE(p_days)
                CHANGING VALUE(p_new_date).
p_new_date = p_date + p_days.
ENDFORM.

*&---------------------------------------------------------------------*
*& Form cal_date3w
*&---------------------------------------------------------------------*
*& text
*&---------------------------------------------------------------------*
*& -->  p1        text
*& <--  p2        text
*&---------------------------------------------------------------------*
FORM cal_date3w USING VALUE(p_date)
                      VALUE(p_days)
                      CHANGING VALUE(p_new_date).
p_new_date = p_date + p_days.

ENDFORM.
